app/controllers/clientes_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def index
    @clientes = Cliente.all

INSERT INTO `clientes` (`created_at`, `idade`, `nome`, `updated_at`) VALUES ('2014-09-28 03:18:57', 22, 'Alessandro', '2014-09-28 03:18:57')
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save