app/controllers/restaurantes_controller.rb

	def index
		@restaurantes = Restaurante.order :nome
---
SELECT `restaurantes`.* FROM `restaurantes`   ORDER BY `restaurantes`.`nome` ASC

	def show
		@restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes`  WHERE `restaurantes`.`id` = 1 LIMIT 1

	def destroy
		@restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes`  WHERE `restaurantes`.`id` = 2 LIMIT 1

	def create
		@restaurante = Restaurante.new(restaurante_params)

		if @restaurante.save
---
INSERT INTO `restaurantes` (`created_at`, `endereco`, `especialidade`, `nome`, `updated_at`) VALUES ('2014-09-02 02:55:39', 'Teste', 'Teste', 'Alessandro', '2014-09-02 02:55:39')

	def edit
		@restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes`  WHERE `restaurantes`.`id` = 6 LIMIT 1

	def update
		@restaurante = Restaurante.find(params[:id])
		@restaurante.update_attributes(restaurante_params)
---
SELECT  `restaurantes`.* FROM `restaurantes`  WHERE `restaurantes`.`id` = 6 LIMIT 1
UPDATE `restaurantes` SET `nome` = 'AlessandroTeste', `updated_at` = '2014-09-02 19:45:02' WHERE `restaurantes`.`id` = 6